{ "posts": [{ "id": 1, "Title": "Title 1", "Rating": [108, 934, 138, 360, 588, 63, 642, 706, 656, 266], "Topics": ["Topic15", "Topic3", "Topic2", "Topic7", "Topic11", "Topic17", "Topic16", "Topic1", "Topic13", "Topic6", "Topic5", "Topic14", "Topic10"] }, { "id": 2, "Title": "Title 2", "Rating": [498, 373, 144, 711, 656, 712, 207, 12, 630, 771], "Topics": ["Topic1", "Topic9", "Topic5", "Topic12", "Topic13", "Topic11", "Topic7", "Topic17", "Topic2", "Topic10", "Topic3", "Topic16", "Topic19", "Topic8", "Topic15"] }, { "id": 3, "Title": "Title 3", "Rating": [109, 852, 340, 361, 629, 667, 267, 577, 139, 448], "Topics": ["Topic1", "Topic10", "Topic3", "Topic9", "Topic19", "Topic11", "Topic7", "Topic14", "Topic5", "Topic4", "Topic6", "Topic20", "Topic12", "Topic16", "Topic13", "Topic18"] }, { "id": 4, "Title": "Title 4", "Rating": [243, 232, 649, 166, 460, 485, 846, 12, 458, 405], "Topics": ["Topic19", "Topic14", "Topic20", "Topic10", "Topic8", "Topic12", "Topic2", "Topic3", "Topic17", "Topic6", "Topic7", "Topic9", "Topic16", "Topic11", "Topic15"] }, { "id": 5, "Title": "Title 5", "Rating": [953, 185, 798, 794, 197, 159, 752, 33, 917, 743], "Topics": ["Topic9", "Topic3", "Topic17", "Topic4", "Topic15", "Topic11", "Topic7", "Topic8", "Topic6", "Topic16", "Topic2", "Topic12"] }, { "id": 6, "Title": "Title 6", "Rating": [616, 144, 150, 649, 38, 89, 931, 890, 437, 333], "Topics": ["Topic13", "Topic1", "Topic15", "Topic9", "Topic14", "Topic16", "Topic6", "Topic5", "Topic17", "Topic11"] }, { "id": 7, "Title": "Title 7", "Rating": [102, 35, 354, 544, 325, 693, 146, 445, 787, 856], "Topics": ["Topic12", "Topic13"] }, { "id": 8, "Title": "Title 8", "Rating": [114, 399, 650, 352, 882, 396, 921, 877, 713, 607], "Topics": ["Topic12", "Topic10", "Topic8", "Topic7", "Topic18", "Topic11"] }, { "id": 9, "Title": "Title 9", "Rating": [791, 483, 695, 343, 419, 269, 847, 486, 877, 357], "Topics": ["Topic6", "Topic9", "Topic14", "Topic4"] }, { "id": 10, "Title": "Title 10", "Rating": [298, 166, 491, 103, 270, 877, 175, 125, 623, 585], "Topics": ["Topic11", "Topic4"] }], "hints": [{ "id": 1, "hint": "Не стоит ставить корабли в углы поля: обычно по ним стреляют в первую очередь новички. Однако, про исключения пойдёт речь ниже" }, { "id": 2, "hint": "Необходимо выработать стратегию для расстановки. Хороший результат даёт неравномерное распределение кораблей: собрать все «большие» корабли в одну или две плотных группировки, а оставшиеся «однопалубники» запрятать отдельно в потайных местах игрового поля. В этом случае противник быстро вычислит и разгромит группировку больших кораблей, а потом будет долго разыскивать оставшиеся маленькие" }, { "id": 3, "hint": "Убив большой корабль, противник окружает его точками. Значит, найдя «четырёхпалубник», противник сразу же открывает (4+1+1)*3 = 18 клеток (то есть 18% или почти 1/5 часть поля). «Трёхпалубник» даёт 15 клеток (15%), «двухпалубник» — 12%, и «однопалубник» — 9%. Если же поставить «четрырёхпалубник» к стенке, то он позволит открыть только 12 клеток (10 для трёхпалубника, 8, для двухпалубника). Если же поставить «четырёхпалубник» вообще в угол, он позволит открыть только 10 клеток (8, 6 и 4 соответственно). Конечно, если противник поймёт, что все корабли находятся с краю, он их быстро потопит. Поэтому, лучше использовать этот совет в сочетании с предыдущим." }, { "id": 4, "hint": "Тактика стрельбы тоже может быть различной. Однако, истребление кораблей противника лучше всего начинать с поиска «четырёхпалубника». Для этого можно стрелять по диагоналям, или нарисовать ромб, или стрелять через 3 клетки на четвёртую. Как только четырёхпалубный корабль найден, ищем трёхпалубные, потом двух... Конечно, в процессе поиска будет попадаться «всякая мелочь» и вносить коррективы в планы." }, { "id": 5, "hint": "Как нам атаковать, чтобы скорее найти четырехпалубный линкор? Что если попробовать стрелять по клеткам так, как ходит конь по шахматному полю? Но только чуть иначе: после выстрела в одну клетку делать еще два шага вперед и один - вбок, по диагонали. То есть после того, как мы обстреляем четыре клетки в одном направлении, следующий удар нанести направо или налево, чтобы точки образовывать букву “Г”." }, { "id": 6, "hint": "После двух промахов на одном участке переходите к обстрелу следующего участка. Если вы дважды промазали в одном месте игрового поля, попробуйте попытать удачу на другом участке. В такой ситуации вероятность снова промазать будет меньше, если обстрелом вы охватите большую площадь, а не будете продолжать обстреливать неудачный участок" }, { "id": 7, "hint": "Сократите площадь обстрела после попадания по кораблю. После первого попадания вам необходимо сократить площадь обстрела до ближайших клеток по горизонтали и вертикали вокруг удачного выстрела." }] }